import telebot

bot = telebot.TeleBot('1000706336:AAGD47i7iXbi7n2qZsMq7uFGCYN9x0YxEes')
keyboard1 = telebot.types.ReplyKeyboardMarkup(True)
keyboard1.row('Японский тест', 'Китайский тест', 'Методика Ибн Сина')
keyboard2 = telebot.types.ReplyKeyboardMarkup(True)
keyboard2.add('янв', 'фев', 'мар', 'апр', 'май', 'июн', 'июл', 'авг', 'сен', 'окт', 'ноя', 'дек', 'назад')
keyboard3 = telebot.types.ReplyKeyboardMarkup(True)
keyboard3.add('янв (Мать-янв)', 'фев (Мать-янв)', 'мар (Мать-янв)', 'апр (Мать-янв)', 'май (Мать-янв)', 'июн (Мать-янв)', 'июл (Мать-янв)', 'авг (Мать-янв)', 'сен (Мать-янв)', 'окт (Мать-янв)', 'ноя (Мать-янв)', 'дек (Мать-янв)', 'назад')
keyboard31 = telebot.types.ReplyKeyboardMarkup(True)
keyboard31.add('янв (Мать-фев)', 'фев (Мать-фев)', 'мар (Мать-фев)', 'апр (Мать-фев)', 'май (Мать-фев)', 'июн (Мать-фев)', 'июл (Мать-фев)', 'авг (Мать-фев)', 'сен (Мать-фев)', 'окт (Мать-фев)', 'ноя (Мать-фев)', 'дек (Мать-фев)', 'назад')
keyboard32 = telebot.types.ReplyKeyboardMarkup(True)
keyboard32.add('янв (Мать-мар)', 'фев (Мать-мар)', 'мар (Мать-мар)', 'апр (Мать-мар)', 'май (Мать-мар)', 'июн (Мать-мар)', 'июл (Мать-мар)', 'авг (Мать-мар)', 'сен (Мать-мар)', 'окт (Мать-мар)', 'ноя (Мать-мар)', 'дек (Мать-мар)', 'назад')
keyboard33 = telebot.types.ReplyKeyboardMarkup(True)
keyboard33.add('янв (Мать-апр)', 'фев (Мать-апр)', 'мар (Мать-апр)', 'апр (Мать-апр)', 'май (Мать-апр)', 'июн (Мать-апр)', 'июл (Мать-апр)', 'авг (Мать-апр)', 'сен (Мать-апр)', 'окт (Мать-апр)', 'ноя (Мать-апр)', 'дек (Мать-апр)', 'назад')
keyboard34 = telebot.types.ReplyKeyboardMarkup(True)
keyboard34.add('янв (Мать-май)', 'фев (Мать-май)', 'мар (Мать-май)', 'апр (Мать-май)', 'май (Мать-май)', 'июн (Мать-май)', 'июл (Мать-май)', 'авг (Мать-май)', 'сен (Мать-май)', 'окт (Мать-май)', 'ноя (Мать-май)', 'дек (Мать-май)', 'назад')
keyboard35 = telebot.types.ReplyKeyboardMarkup(True)
keyboard35.add('янв (Мать-июн)', 'фев (Мать-июн)', 'мар (Мать-июн)', 'апр (Мать-июн)', 'май (Мать-июн)', 'июн (Мать-июн)', 'июл (Мать-июн)', 'авг (Мать-июн)', 'сен (Мать-июн)', 'окт (Мать-июн)', 'ноя (Мать-июн)', 'дек (Мать-июн)', 'назад')
keyboard36 = telebot.types.ReplyKeyboardMarkup(True)
keyboard36.add('янв (Мать-июл)', 'фев (Мать-июл)', 'мар (Мать-июл)', 'апр (Мать-июл)', 'май (Мать-июл)', 'июн (Мать-июл)', 'июл (Мать-июл)', 'авг (Мать-июл)', 'сен (Мать-июл)', 'окт (Мать-июл)', 'ноя (Мать-июл)', 'дек (Мать-июл)', 'назад')
keyboard37 = telebot.types.ReplyKeyboardMarkup(True)
keyboard37.add('янв (Мать-авг)', 'фев (Мать-авг)', 'мар (Мать-авг)', 'апр (Мать-авг)', 'май (Мать-авг)', 'июн (Мать-авг)', 'июл (Мать-авг)', 'авг (Мать-авг)', 'сен (Мать-авг)', 'окт (Мать-авг)', 'ноя (Мать-авг)', 'дек (Мать-авг)', 'назад')
keyboard38 = telebot.types.ReplyKeyboardMarkup(True)
keyboard38.add('янв (Мать-сен)', 'фев (Мать-сен)', 'мар (Мать-сен)', 'апр (Мать-сен)', 'май (Мать-сен)', 'июн (Мать-сен)', 'июл (Мать-сен)', 'авг (Мать-сен)', 'сен (Мать-сен)', 'окт (Мать-сен)', 'ноя (Мать-сен)', 'дек (Мать-сен)', 'назад')
keyboard39 = telebot.types.ReplyKeyboardMarkup(True)
keyboard39.add('янв (Мать-окт)', 'фев (Мать-окт)', 'мар (Мать-окт)', 'апр (Мать-окт)', 'май (Мать-окт)', 'июн (Мать-окт)', 'июл (Мать-окт)', 'авг (Мать-окт)', 'сен (Мать-окт)', 'окт (Мать-окт)', 'ноя (Мать-окт)', 'дек (Мать-окт)', 'назад')
keyboard310 = telebot.types.ReplyKeyboardMarkup(True)
keyboard310.add('янв (Мать-ноя)', 'фев (Мать-ноя)', 'мар (Мать-ноя)', 'апр (Мать-ноя)', 'май (Мать-ноя)', 'июн (Мать-ноя)', 'июл (Мать-ноя)', 'авг (Мать-ноя)', 'сен (Мать-ноя)', 'окт (Мать-ноя)', 'ноя (Мать-ноя)', 'дек (Мать-ноя)', 'назад')
keyboard311 = telebot.types.ReplyKeyboardMarkup(True)
keyboard311.add('янв (Мать-дек)', 'фев (Мать-дек)', 'мар (Мать-дек)', 'апр (Мать-дек)', 'май (Мать-дек)', 'июн (Мать-дек)', 'июл (Мать-дек)', 'авг (Мать-дек)', 'сен (Мать-дек)', 'окт (Мать-дек)', 'ноя (Мать-дек)', 'дек (Мать-дек)', 'назад')
keyboard5 = telebot.types.ReplyKeyboardMarkup(True)
keyboard5.add('ўғил фарзанд кўриш дуоси', 'фарзанд кўриш дуоси', 'бошқа фойдали маълумотлар', 'назад')
keyboard6 = telebot.types.ReplyKeyboardMarkup(True)
keyboard6.add('эркаклар ҳақида', 'аёллар ҳақида', 'кучли таомлар', 'яна бошқа фойдали маълумотлар', 'назад')
keyboard7 = telebot.types.ReplyKeyboardMarkup(True)
keyboard7.row('назад')
keyboard8 = telebot.types.ReplyKeyboardMarkup(True)
keyboard8.add('Как определить лунный возраст','назад')
keyboard9 = telebot.types.ReplyKeyboardMarkup(True)
keyboard9.add('18 (Месяц зачатия - 1.)','19 (Месяц зачатия - 1.)','20 (Месяц зачатия - 1.)','21 (Месяц зачатия - 1.)','22 (Месяц зачатия - 1.)','23 (Месяц зачатия - 1.)','24 (Месяц зачатия - 1.)','25 (Месяц зачатия - 1.)','26 (Месяц зачатия - 1.)','27 (Месяц зачатия - 1.)','28 (Месяц зачатия - 1.)','29 (Месяц зачатия - 1.)','30 (Месяц зачатия - 1.)','31 (Месяц зачатия - 1.)','32 (Месяц зачатия - 1.)','33 (Месяц зачатия - 1.)','34 (Месяц зачатия - 1.)','35 (Месяц зачатия - 1.)','36 (Месяц зачатия - 1.)','37 (Месяц зачатия - 1.)','38 (Месяц зачатия - 1.)','39 (Месяц зачатия - 1.)','40 (Месяц зачатия - 1.)','41 (Месяц зачатия - 1.)','42 (Месяц зачатия - 1.)','43 (Месяц зачатия - 1.)','44 (Месяц зачатия - 1.)','45 (Месяц зачатия - 1.)','назад')
keyboard91 = telebot.types.ReplyKeyboardMarkup(True)
keyboard91.add('18 (Месяц зачатия - 2.)','19 (Месяц зачатия - 2.)','20 (Месяц зачатия - 2.)','21 (Месяц зачатия - 2.)','22 (Месяц зачатия - 2.)','23 (Месяц зачатия - 2.)','24 (Месяц зачатия - 2.)','25 (Месяц зачатия - 2.)','26 (Месяц зачатия - 2.)','27 (Месяц зачатия - 2.)','28 (Месяц зачатия - 2.)','29 (Месяц зачатия - 2.)','30 (Месяц зачатия - 2.)','31 (Месяц зачатия - 2.)','32 (Месяц зачатия - 2.)','33 (Месяц зачатия - 2.)','34 (Месяц зачатия - 2.)','35 (Месяц зачатия - 2.)','36 (Месяц зачатия - 2.)','37 (Месяц зачатия - 2.)','38 (Месяц зачатия - 2.)','39 (Месяц зачатия - 2.)','40 (Месяц зачатия - 2.)','41 (Месяц зачатия - 2.)','42 (Месяц зачатия - 2.)','43 (Месяц зачатия - 2.)','44 (Месяц зачатия - 2.)','45 (Месяц зачатия - 2.)','назад')
keyboard92 = telebot.types.ReplyKeyboardMarkup(True)
keyboard92.add('18 (Месяц зачатия - 3.)','19 (Месяц зачатия - 3.)','20 (Месяц зачатия - 3.)','21 (Месяц зачатия - 3.)','22 (Месяц зачатия - 3.)','23 (Месяц зачатия - 3.)','24 (Месяц зачатия - 3.)','25 (Месяц зачатия - 3.)','26 (Месяц зачатия - 3.)','27 (Месяц зачатия - 3.)','28 (Месяц зачатия - 3.)','29 (Месяц зачатия - 3.)','30 (Месяц зачатия - 3.)','31 (Месяц зачатия - 3.)','32 (Месяц зачатия - 3.)','33 (Месяц зачатия - 3.)','34 (Месяц зачатия - 3.)','35 (Месяц зачатия - 3.)','36 (Месяц зачатия - 3.)','37 (Месяц зачатия - 3.)','38 (Месяц зачатия - 3.)','39 (Месяц зачатия - 3.)','40 (Месяц зачатия - 3.)','41 (Месяц зачатия - 3.)','42 (Месяц зачатия - 3.)','43 (Месяц зачатия - 3.)','44 (Месяц зачатия - 3.)','45 (Месяц зачатия - 3.)','назад')
keyboard93 = telebot.types.ReplyKeyboardMarkup(True)
keyboard93.add('18 (Месяц зачатия - 4.)','19 (Месяц зачатия - 4.)','20 (Месяц зачатия - 4.)','21 (Месяц зачатия - 4.)','22 (Месяц зачатия - 4.)','23 (Месяц зачатия - 4.)','24 (Месяц зачатия - 4.)','25 (Месяц зачатия - 4.)','26 (Месяц зачатия - 4.)','27 (Месяц зачатия - 4.)','28 (Месяц зачатия - 4.)','29 (Месяц зачатия - 4.)','30 (Месяц зачатия - 4.)','31 (Месяц зачатия - 4.)','32 (Месяц зачатия - 4.)','33 (Месяц зачатия - 4.)','34 (Месяц зачатия - 4.)','35 (Месяц зачатия - 4.)','36 (Месяц зачатия - 4.)','37 (Месяц зачатия - 4.)','38 (Месяц зачатия - 4.)','39 (Месяц зачатия - 4.)','40 (Месяц зачатия - 4.)','41 (Месяц зачатия - 4.)','42 (Месяц зачатия - 4.)','43 (Месяц зачатия - 4.)','44 (Месяц зачатия - 4.)','45 (Месяц зачатия - 4.)','назад')
keyboard94 = telebot.types.ReplyKeyboardMarkup(True)
keyboard94.add('18 (Месяц зачатия - 5.)','19 (Месяц зачатия - 5.)','20 (Месяц зачатия - 5.)','21 (Месяц зачатия - 5.)','22 (Месяц зачатия - 5.)','23 (Месяц зачатия - 5.)','24 (Месяц зачатия - 5.)','25 (Месяц зачатия - 5.)','26 (Месяц зачатия - 5.)','27 (Месяц зачатия - 5.)','28 (Месяц зачатия - 5.)','29 (Месяц зачатия - 5.)','30 (Месяц зачатия - 5.)','31 (Месяц зачатия - 5.)','32 (Месяц зачатия - 5.)','33 (Месяц зачатия - 5.)','34 (Месяц зачатия - 5.)','35 (Месяц зачатия - 5.)','36 (Месяц зачатия - 5.)','37 (Месяц зачатия - 5.)','38 (Месяц зачатия - 5.)','39 (Месяц зачатия - 5.)','40 (Месяц зачатия - 5.)','41 (Месяц зачатия - 5.)','42 (Месяц зачатия - 5.)','43 (Месяц зачатия - 5.)','44 (Месяц зачатия - 5.)','45 (Месяц зачатия - 5.)','назад')
keyboard95 = telebot.types.ReplyKeyboardMarkup(True)
keyboard95.add('18 (Месяц зачатия - 6.)','19 (Месяц зачатия - 6.)','20 (Месяц зачатия - 6.)','21 (Месяц зачатия - 6.)','22 (Месяц зачатия - 6.)','23 (Месяц зачатия - 6.)','24 (Месяц зачатия - 6.)','25 (Месяц зачатия - 6.)','26 (Месяц зачатия - 6.)','27 (Месяц зачатия - 6.)','28 (Месяц зачатия - 6.)','29 (Месяц зачатия - 6.)','30 (Месяц зачатия - 6.)','31 (Месяц зачатия - 6.)','32 (Месяц зачатия - 6.)','33 (Месяц зачатия - 6.)','34 (Месяц зачатия - 6.)','35 (Месяц зачатия - 6.)','36 (Месяц зачатия - 6.)','37 (Месяц зачатия - 6.)','38 (Месяц зачатия - 6.)','39 (Месяц зачатия - 6.)','40 (Месяц зачатия - 6.)','41 (Месяц зачатия - 6.)','42 (Месяц зачатия - 6.)','43 (Месяц зачатия - 6.)','44 (Месяц зачатия - 6.)','45 (Месяц зачатия - 6.)','назад')
keyboard96 = telebot.types.ReplyKeyboardMarkup(True)
keyboard96.add('18 (Месяц зачатия - 7.)','19 (Месяц зачатия - 7.)','20 (Месяц зачатия - 7.)','21 (Месяц зачатия - 7.)','22 (Месяц зачатия - 7.)','23 (Месяц зачатия - 7.)','24 (Месяц зачатия - 7.)','25 (Месяц зачатия - 7.)','26 (Месяц зачатия - 7.)','27 (Месяц зачатия - 7.)','28 (Месяц зачатия - 7.)','29 (Месяц зачатия - 7.)','30 (Месяц зачатия - 7.)','31 (Месяц зачатия - 7.)','32 (Месяц зачатия - 7.)','33 (Месяц зачатия - 7.)','34 (Месяц зачатия - 7.)','35 (Месяц зачатия - 7.)','36 (Месяц зачатия - 7.)','37 (Месяц зачатия - 7.)','38 (Месяц зачатия - 7.)','39 (Месяц зачатия - 7.)','40 (Месяц зачатия - 7.)','41 (Месяц зачатия - 7.)','42 (Месяц зачатия - 7.)','43 (Месяц зачатия - 7.)','44 (Месяц зачатия - 7.)','45 (Месяц зачатия - 7.)','назад')
keyboard97 = telebot.types.ReplyKeyboardMarkup(True)
keyboard97.add('18 (Месяц зачатия - 8.)','19 (Месяц зачатия - 8.)','20 (Месяц зачатия - 8.)','21 (Месяц зачатия - 8.)','22 (Месяц зачатия - 8.)','23 (Месяц зачатия - 8.)','24 (Месяц зачатия - 8.)','25 (Месяц зачатия - 8.)','26 (Месяц зачатия - 8.)','27 (Месяц зачатия - 8.)','28 (Месяц зачатия - 8.)','29 (Месяц зачатия - 8.)','30 (Месяц зачатия - 8.)','31 (Месяц зачатия - 8.)','32 (Месяц зачатия - 8.)','33 (Месяц зачатия - 8.)','34 (Месяц зачатия - 8.)','35 (Месяц зачатия - 8.)','36 (Месяц зачатия - 8.)','37 (Месяц зачатия - 8.)','38 (Месяц зачатия - 8.)','39 (Месяц зачатия - 8.)','40 (Месяц зачатия - 8.)','41 (Месяц зачатия - 8.)','42 (Месяц зачатия - 8.)','43 (Месяц зачатия - 8.)','44 (Месяц зачатия - 8.)','45 (Месяц зачатия - 8.)','назад')
keyboard98 = telebot.types.ReplyKeyboardMarkup(True)
keyboard98.add('18 (Месяц зачатия - 9.)','19 (Месяц зачатия - 9.)','20 (Месяц зачатия - 9.)','21 (Месяц зачатия - 9.)','22 (Месяц зачатия - 9.)','23 (Месяц зачатия - 9.)','24 (Месяц зачатия - 9.)','25 (Месяц зачатия - 9.)','26 (Месяц зачатия - 9.)','27 (Месяц зачатия - 9.)','28 (Месяц зачатия - 9.)','29 (Месяц зачатия - 9.)','30 (Месяц зачатия - 9.)','31 (Месяц зачатия - 9.)','32 (Месяц зачатия - 9.)','33 (Месяц зачатия - 9.)','34 (Месяц зачатия - 9.)','35 (Месяц зачатия - 9.)','36 (Месяц зачатия - 9.)','37 (Месяц зачатия - 9.)','38 (Месяц зачатия - 9.)','39 (Месяц зачатия - 9.)','40 (Месяц зачатия - 9.)','41 (Месяц зачатия - 9.)','42 (Месяц зачатия - 9.)','43 (Месяц зачатия - 9.)','44 (Месяц зачатия - 9.)','45 (Месяц зачатия - 9.)','назад')
keyboard99 = telebot.types.ReplyKeyboardMarkup(True)
keyboard99.add('18 (Месяц зачатия - 10.)','19 (Месяц зачатия - 10.)','20 (Месяц зачатия - 10.)','21 (Месяц зачатия - 10.)','22 (Месяц зачатия - 10.)','23 (Месяц зачатия - 10.)','24 (Месяц зачатия - 10.)','25 (Месяц зачатия - 10.)','26 (Месяц зачатия - 10.)','27 (Месяц зачатия - 10.)','28 (Месяц зачатия - 10.)','29 (Месяц зачатия - 10.)','30 (Месяц зачатия - 10.)','31 (Месяц зачатия - 10.)','32 (Месяц зачатия - 10.)','33 (Месяц зачатия - 10.)','34 (Месяц зачатия - 10.)','35 (Месяц зачатия - 10.)','36 (Месяц зачатия - 10.)','37 (Месяц зачатия - 10.)','38 (Месяц зачатия - 10.)','39 (Месяц зачатия - 10.)','40 (Месяц зачатия - 10.)','41 (Месяц зачатия - 10.)','42 (Месяц зачатия - 10.)','43 (Месяц зачатия - 10.)','44 (Месяц зачатия - 10.)','45 (Месяц зачатия - 10.)','назад')
keyboard910 = telebot.types.ReplyKeyboardMarkup(True)
keyboard910.add('18 (Месяц зачатия - 11.)','19 (Месяц зачатия - 11.)','20 (Месяц зачатия - 11.)','21 (Месяц зачатия - 11.)','22 (Месяц зачатия - 11.)','23 (Месяц зачатия - 11.)','24 (Месяц зачатия - 11.)','25 (Месяц зачатия - 11.)','26 (Месяц зачатия - 11.)','27 (Месяц зачатия - 11.)','28 (Месяц зачатия - 11.)','29 (Месяц зачатия - 11.)','30 (Месяц зачатия - 11.)','31 (Месяц зачатия - 11.)','32 (Месяц зачатия - 11.)','33 (Месяц зачатия - 11.)','34 (Месяц зачатия - 11.)','35 (Месяц зачатия - 11.)','36 (Месяц зачатия - 11.)','37 (Месяц зачатия - 11.)','38 (Месяц зачатия - 11.)','39 (Месяц зачатия - 11.)','40 (Месяц зачатия - 11.)','41 (Месяц зачатия - 11.)','42 (Месяц зачатия - 11.)','43 (Месяц зачатия - 11.)','44 (Месяц зачатия - 11.)','45 (Месяц зачатия - 11.)','назад')
keyboard911 = telebot.types.ReplyKeyboardMarkup(True)
keyboard911.add('18 (Месяц зачатия - 12.)','19 (Месяц зачатия - 12.)','20 (Месяц зачатия - 12.)','21 (Месяц зачатия - 12.)','22 (Месяц зачатия - 12.)','23 (Месяц зачатия - 12.)','24 (Месяц зачатия - 12.)','25 (Месяц зачатия - 12.)','26 (Месяц зачатия - 12.)','27 (Месяц зачатия - 12.)','28 (Месяц зачатия - 12.)','29 (Месяц зачатия - 12.)','30 (Месяц зачатия - 12.)','31 (Месяц зачатия - 12.)','32 (Месяц зачатия - 12.)','33 (Месяц зачатия - 12.)','34 (Месяц зачатия - 12.)','35 (Месяц зачатия - 12.)','36 (Месяц зачатия - 12.)','37 (Месяц зачатия - 12.)','38 (Месяц зачатия - 12.)','39 (Месяц зачатия - 12.)','40 (Месяц зачатия - 12.)','41 (Месяц зачатия - 12.)','42 (Месяц зачатия - 12.)','43 (Месяц зачатия - 12.)','44 (Месяц зачатия - 12.)','45 (Месяц зачатия - 12.)','назад')
keyboard10 = telebot.types.ReplyKeyboardMarkup(True)
keyboard10.add('1','2','3','3','4','5','6','7','8','9','10','11','12','Как определить лунный возраст','назад')

@bot.message_handler(commands=['start'])
def start_message(message):
    bot.send_message(message.chat.id, 'Привет, выбери тест', reply_markup=keyboard1)


@bot.message_handler(content_types=['text'])
def send_text(message):
    if message.text.lower() == 'японский тест':
        bot.send_message(message.chat.id, 'Месяц рождения матери?', reply_markup=keyboard2)
    if message.text.lower() == 'китайский тест':
        bot.send_message(message.chat.id, 'Месяц зачатия по лунному календарю?', reply_markup=keyboard10)
    if message.text.lower() == 'методика ибн сина':
        bot.send_message(message.chat.id, 'В данный момент этот раздел в стадии разработки.', reply_markup=keyboard1)
    if message.text.lower() in ('эркаклар ҳақида', 'аёллар ҳақида', 'кучли таомлар', 'яна бошқа фойдали маълумотлар'):
        bot.send_message(message.chat.id, 'В данный момент этот раздел в стадии разработки.', reply_markup=keyboard6)        
    if message.text.lower() == 'назад':
        bot.send_message(message.chat.id, 'Ok!', reply_markup=keyboard1)
    if message.text.lower() == 'ўғил фарзанд кўриш дуоси':
        bot.send_message(message.chat.id, 'Бисмиллаҳир Аҳад Ас Сомадуллазий лам ялид ва лам юлад-Аллоҳумма инний саммайту ма фии ҳазал батни Муҳаммадин би исми Муҳаммад С.А.В', reply_markup=keyboard5)
    if message.text.lower() == 'фарзанд кўриш дуоси':
        bot.send_message(message.chat.id, 'Рабби ла тазарни фардан ва анта хайр ул-ваарисийн. Рабби хаб ли мин лядунка зуррийатан тайибатан иннака самиу-дуа', reply_markup=keyboard5)
    if message.text.lower() == 'бошқа фойдали маълумотлар':
        bot.send_message(message.chat.id, 'Ok!', reply_markup=keyboard6)
    if message.text.lower() == 'янв':
        bot.send_message(message.chat.id, '(Мать - янв.) Месяц рождения отца?', reply_markup=keyboard3)
    if message.text.lower() == 'фев':
        bot.send_message(message.chat.id, '(Мать - фев.) Месяц рождения отца?', reply_markup=keyboard31)
    if message.text.lower() == 'мар':
        bot.send_message(message.chat.id, '(Мать - мар.) Месяц рождения отца?', reply_markup=keyboard32)
    if message.text.lower() == 'апр':
        bot.send_message(message.chat.id, '(Мать - апр.) Месяц рождения отца?', reply_markup=keyboard33)
    if message.text.lower() == 'май':
        bot.send_message(message.chat.id, '(Мать - май.) Месяц рождения отца?', reply_markup=keyboard34)
    if message.text.lower() == 'июн':
        bot.send_message(message.chat.id, '(Мать - июн.) Месяц рождения отца?', reply_markup=keyboard35)
    if message.text.lower() == 'июл':
        bot.send_message(message.chat.id, '(Мать - июл.) Месяц рождения отца?', reply_markup=keyboard36)
    if message.text.lower() == 'авг':
        bot.send_message(message.chat.id, '(Мать - авг.) Месяц рождения отца?', reply_markup=keyboard37)
    if message.text.lower() == 'сен':
        bot.send_message(message.chat.id, '(Мать - сен.) Месяц рождения отца?', reply_markup=keyboard38)
    if message.text.lower() == 'окт':
        bot.send_message(message.chat.id, '(Мать - окт.) Месяц рождения отца?', reply_markup=keyboard39)
    if message.text.lower() == 'ноя':
        bot.send_message(message.chat.id, '(Мать - ноя.) Месяц рождения отца?', reply_markup=keyboard310)
    if message.text.lower() == 'дек':
        bot.send_message(message.chat.id, '(Мать - дек.) Месяц рождения отца?', reply_markup=keyboard311)
    if message.text.lower() == '1':
        bot.send_message(message.chat.id, '(Месяц зачатия - 1.) Лунный возраст матери?', reply_markup=keyboard9)
    if message.text.lower() == '2':
        bot.send_message(message.chat.id, '(Месяц зачатия - 2.) Лунный возраст матери?', reply_markup=keyboard91)        
    if message.text.lower() == '3':
        bot.send_message(message.chat.id, '(Месяц зачатия - 3.) Лунный возраст матери?', reply_markup=keyboard92)        
    if message.text.lower() == '4':
        bot.send_message(message.chat.id, '(Месяц зачатия - 4.) Лунный возраст матери?', reply_markup=keyboard93)
    if message.text.lower() == '5':
        bot.send_message(message.chat.id, '(Месяц зачатия - 5.) Лунный возраст матери?', reply_markup=keyboard94)        
    if message.text.lower() == '6':
        bot.send_message(message.chat.id, '(Месяц зачатия - 6.) Лунный возраст матери?', reply_markup=keyboard95)        
    if message.text.lower() == '7':
        bot.send_message(message.chat.id, '(Месяц зачатия - 7.) Лунный возраст матери?', reply_markup=keyboard96)
    if message.text.lower() == '8':
        bot.send_message(message.chat.id, '(Месяц зачатия - 8.) Лунный возраст матери?', reply_markup=keyboard97)        
    if message.text.lower() == '9':
        bot.send_message(message.chat.id, '(Месяц зачатия - 9.) Лунный возраст матери?', reply_markup=keyboard98)        
    if message.text.lower() == '10':
        bot.send_message(message.chat.id, '(Месяц зачатия - 10.) Лунный возраст матери?', reply_markup=keyboard99)
    if message.text.lower() == '181':
        bot.send_message(message.chat.id, '(Месяц зачатия - 11.) Лунный возраст матери?', reply_markup=keyboard910)        
    if message.text.lower() == '12':
        bot.send_message(message.chat.id, '(Месяц зачатия - 12.) Лунный возраст матери?', reply_markup=keyboard911)        
    if  message.text.lower() in i1:
        bot.send_message(message.chat.id, 'Мальчик - Май(95%)/Сентябрь(80%)/Ноябрь-Декабрь(70%), \nДевочка - Октябрь(95%)/Март(80%)/Февраль,Апрель(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i2:
        bot.send_message(message.chat.id, 'Мальчик - Июнь(95%)/Октябрь(80%)/Декабрь(70%), \nДевочка - Ноябрь(95%)/Апрель(80%)/Январь,Март,Май(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i3:
        bot.send_message(message.chat.id, 'Мальчик - Июль(95%)/Ноябрь(80%), \nДевочка - Декабрь(95%)/Май(80%)/Февраль,Апрель,Июнь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i4:
        bot.send_message(message.chat.id, 'Мальчик - Август(95%)/Декабрь(80%), \nДевочка - Июнь(80%)/Январь,Март,Май,Июль(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i5:
        bot.send_message(message.chat.id, 'Мальчик - Сентябрь(95%)/Январь(80%), \nДевочка - Июль(80%)/Февраль,Апрель,Июнь, Август(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i6:
        bot.send_message(message.chat.id, 'Мальчик - Октябрь(95%)/Февраль(80%), \nДевочка - Август(80%)/Март,Май,Июль,Сентябрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i7:
        bot.send_message(message.chat.id, 'Мальчик - Октябрь(90%)/Февраль(80%)/Апрель,Май(70%), \nДевочка - Март(95%)/Ноябрь(80%)/Август,Декабрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i8:
        bot.send_message(message.chat.id, 'Мальчик - Ноябрь(90%)/Март(80%)/Май,Июнь(70%), \nДевочка - Апрель(95%)/Декабрь(80%)/Сентябрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i9:
        bot.send_message(message.chat.id, 'Мальчик - Декабрь(90%)/Апрель(80%)/Июнь,Июль(70%), \nДевочка - Май(95%)/Октябрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i10:
        bot.send_message(message.chat.id, 'Мальчик - Январь(95%)/Май(80%)/Июль,Август(70%), \nДевочка - Июнь(95%)/Ноябрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i11:
        bot.send_message(message.chat.id, 'Мальчик - Февраль(95%)/Июнь(80%)/Август,Сентябрь(70%), \nДевочка - Июль(95%)/Январь,Декабрь(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i12:
        bot.send_message(message.chat.id, 'Мальчик - Март(95%)/Июль(80%)/Сентябрь,Октябрь(70%), \nДевочка - Август(95%)/Январь(80%)/Февраль(70%)', reply_markup=keyboard5)
    if  message.text.lower() in i13:
        bot.send_message(message.chat.id, 'Мальчик', reply_markup=keyboard5)
    if  message.text.lower() in i14:
        bot.send_message(message.chat.id, 'Девочка', reply_markup=keyboard5)
    if  message.text.lower() == 'как определить лунный возраст':
        bot.send_message(message.chat.id, lk, reply_markup=keyboard10)
     
    
    
i1 = ['янв (мать-янв)', 'апр (мать-янв)', 'июл (мать-янв)', 'окт (мать-янв)', 'янв (мать-май)', 'апр (мать-май)', 'июл (мать-май)', 'окт (мать-май)', 'янв (мать-сен)', 'апр (мать-сен)', 'июл (мать-сен)', 'окт (мать-сен)']    
i2 = ['фев (мать-фев)', 'май (мать-фев)', 'авг (мать-фев)', 'ноя (мать-фев)', 'фев (мать-июн)', 'май (мать-июн)', 'авг (мать-июн)', 'ноя (мать-июн)', 'фев (мать-окт)', 'май (мать-окт)', 'авг (мать-окт)', 'ноя (мать-окт)']    
i3 = ['мар (мать-мар)', 'июн (мать-мар)', 'сен (мать-мар)', 'дек (мать-мар)', 'мар (мать-июл)', 'июн (мать-июл)', 'сен (мать-июл)', 'дек (мать-июл)', 'мар (мать-ноя)', 'июн (мать-ноя)', 'сен (мать-ноя)', 'дек (мать-ноя)']    
i4 = ['янв (мать-апр)', 'апр (мать-апр)', 'июл (мать-апр)', 'окт (мать-апр)', 'янв (мать-авг)', 'апр (мать-авг)', 'июл (мать-авг)', 'окт (мать-авг)', 'янв (мать-дек)', 'апр (мать-дек)', 'июл (мать-дек)', 'окт (мать-дек)']    
i5 = ['фев (мать-янв)', 'май (мать-янв)', 'авг (мать-янв)', 'ноя (мать-янв)', 'фев (мать-май)', 'май (мать-май)', 'авг (мать-май)', 'ноя (мать-май)', 'фев (мать-сен)', 'май (мать-сен)', 'авг (мать-сен)', 'ноя (мать-сен)']    
i6 = ['мар (мать-фев)', 'июн (мать-фев)', 'сен (мать-фев)', 'дек (мать-фев)', 'мар (мать-июн)', 'июн (мать-июн)', 'сен (мать-июн)', 'дек (мать-июн)', 'мар (мать-окт)', 'июн (мать-окт)', 'сен (мать-окт)', 'дек (мать-окт)']    
i7 = ['янв (мать-мар)',	'апр (мать-мар)', 'июл (мать-мар)', 'окт (мать-мар)', 'янв (мать-июл)', 'апр (мать-июл)', 'июл (мать-июл)', 'окт (мать-июл)', 'янв (мать-ноя)', 'апр (мать-ноя)', 'июл (мать-ноя)', 'окт (мать-ноя)']    
i8 = ['фев (мать-апр)', 'май (мать-апр)', 'авг (мать-апр)', 'ноя (мать-апр)', 'фев (мать-авг)', 'май (мать-авг)', 'авг (мать-авг)', 'ноя (мать-авг)', 'фев (мать-дек)', 'май (мать-дек)', 'авг (мать-дек)', 'ноя (мать-дек)']    
i9 = ['мар (мать-янв)', 'июн (мать-янв)', 'сен (мать-янв)', 'дек (мать-янв)', 'мар (мать-май)', 'июн (мать-май)', 'сен (мать-май)', 'дек (мать-май)', 'мар (мать-сен)', 'июн (мать-сен)', 'сен (мать-сен)', 'дек (мать-сен)']    
i10 = ['янв (мать-фев)', 'апр (мать-фев)', 'июл (мать-фев)', 'окт (мать-фев)', 'янв (мать-июн)', 'апр (мать-июн)', 'июл (мать-июн)', 'окт (мать-июн)', 'янв (мать-окт)', 'апр (мать-окт)', 'июл (мать-окт)', 'окт (мать-окт)']    
i11 = ['фев (мать-мар)', 'май (мать-мар)', 'авг (мать-мар)', 'ноя (мать-мар)', 'фев (мать-июл)', 'май (мать-июл)', 'авг (мать-июл)', 'ноя (мать-июл)', 'фев (мать-ноя)', 'май (мать-ноя)', 'авг (мать-ноя)', 'ноя (мать-ноя)']    
i12 = ['мар (мать-апр)', 'июн (мать-апр)', 'сен (мать-апр)', 'дек (мать-апр)', 'мар (мать-авг)', 'июн (мать-авг)', 'сен (мать-авг)', 'дек (мать-авг)', 'мар (мать-дек)', 'июн (мать-дек)', 'сен (мать-дек)', 'дек (мать-дек)']    
i13 = ['18 (месяц зачатия - 2.)', '18 (месяц зачатия - 4.)', '18 (месяц зачатия - 5.)', '18 (месяц зачатия - 6.)', '18 (месяц зачатия - 7.)', '18 (месяц зачатия - 8.)', '18 (месяц зачатия - 9.)', 	'18 (месяц зачатия - 10.)', 	'18 (месяц зачатия - 11.)', '18 (месяц зачатия - 12.)', '19 (месяц зачатия - 1.)', '19 (месяц зачатия - 3.)', '19 (месяц зачатия - 5.)', '19 (месяц зачатия - 6.)', '19 (месяц зачатия - 7.)', '19 (месяц зачатия - 8.)', '19 (месяц зачатия - 9.)', '19 (месяц зачатия - 10.)', '20 (месяц зачатия - 2.)', '20 (месяц зачатия - 4.)', '20 (месяц зачатия - 5.)', '20 (месяц зачатия - 6.)', '20 (месяц зачатия - 7.)', '20 (месяц зачатия - 8.)', '20 (месяц зачатия - 10.)', '20 (месяц зачатия - 11.)', '20 (месяц зачатия - 12.)', '21 (месяц зачатия - 1.)', '22 (месяц зачатия - 2.)', '22 (месяц зачатия - 3.)', '22 (месяц зачатия - 5.)', '22 (месяц зачатия - 8.)', '23 (месяц зачатия - 1.)', '23 (месяц зачатия - 2.)', '23 (месяц зачатия - 4.)', '23 (месяц зачатия - 5.)', '23 (месяц зачатия - 7.)', '23 (месяц зачатия - 9.)', 	'23 (месяц зачатия - 10.)', '23 (месяц зачатия - 11.)', '24 (месяц зачатия - 1.)', '24 (месяц зачатия - 3.)', '24 (месяц зачатия - 4.)', '24 (месяц зачатия - 6.)', '24 (месяц зачатия - 7.)', '25 (месяц зачатия - 2.)', '25 (месяц зачатия - 3.)', '25 (месяц зачатия - 6.)', '25 (месяц зачатия - 9.)', '25 (месяц зачатия - 10.)', '25 (месяц зачатия - 11.)', 	'25 (месяц зачатия - 12.)', '26 (месяц зачатия - 1.)', '26 (месяц зачатия - 3.)', '26 (месяц зачатия - 6.)', '26 (месяц зачатия - 8.)', '27 (месяц зачатия - 2.)', '27 (месяц зачатия - 7.)', '27 (месяц зачатия - 8.)', '27 (месяц зачатия - 9.)', '27 (месяц зачатия - 10.)', '27 (месяц зачатия - 12.)', '28 (месяц зачатия - 1.)', '28 (месяц зачатия - 3.)', '28 (месяц зачатия - 7.)', '28 (месяц зачатия - 8.)', '28 (месяц зачатия - 9.)', '28 (месяц зачатия - 10.)',  '29 (месяц зачатия - 2.)', '29 (месяц зачатия - 5.)', '29 (месяц зачатия - 6.)', '29 (месяц зачатия - 8.)', 	'29 (месяц зачатия - 9.)', '30 (месяц зачатия - 1.)', '30 (месяц зачатия - 11.)', 	'30 (месяц зачатия - 12.)', '31 (месяц зачатия - 1.)', '31 (месяц зачатия - 3.)', '31 (месяц зачатия - 12.)', '32 (месяц зачатия - 1.)', '32 (месяц зачатия - 3.)', '32 (месяц зачатия - 12.)',  '33 (месяц зачатия - 2.)', '33 (месяц зачатия - 4.)', '33 (месяц зачатия - 8.)', '33 (месяц зачатия - 12.)',  '34 (месяц зачатия - 3.)', '34 (месяц зачатия - 11.)', 	'34 (месяц зачатия - 12.)', '35 (месяц зачатия - 1.)', '35 (месяц зачатия - 2.)', '35 (месяц зачатия - 4.)', 	'35 (месяц зачатия - 8.)', '35 (месяц зачатия - 11.)', '35 (месяц зачатия - 12.)',  '36 (месяц зачатия - 2.)', '36 (месяц зачатия - 3.)', '36 (месяц зачатия - 5.)', '36 (месяц зачатия - 9.)', '36 (месяц зачатия - 10.)', '36 (месяц зачатия - 11.)', '36 (месяц зачатия - 12.)', '37 (месяц зачатия - 1.)', '37 (месяц зачатия - 3.)', '37 (месяц зачатия - 4.)', '37 (месяц зачатия - 6.)', '37 (месяц зачатия - 8.)', '37 (месяц зачатия - 10.)', '37 (месяц зачатия - 12.)',  '38 (месяц зачатия - 2.)', '38 (месяц зачатия - 4.)', '38 (месяц зачатия - 5.)', '38 (месяц зачатия - 7.)', '38 (месяц зачатия - 9.)', '38 (месяц зачатия - 11.)', '39 (месяц зачатия - 1.)', '39 (месяц зачатия - 3.)', 	'39 (месяц зачатия - 4.)', '39 (месяц зачатия - 5.)', '39 (месяц зачатия - 8.)', '39 (месяц зачатия - 10.)', 	 '40 (месяц зачатия - 2.)', '40 (месяц зачатия - 4.)', '40 (месяц зачатия - 6.)', '40 (месяц зачатия - 7.)', '40 (месяц зачатия - 9.)', '40 (месяц зачатия - 11.)', '41 (месяц зачатия - 1.)', '41 (месяц зачатия - 3.)', '41 (месяц зачатия - 5.)', '41 (месяц зачатия - 7.)', '41 (месяц зачатия - 8.)', '41 (месяц зачатия - 10.)', '41 (месяц зачатия - 12.)',  '42 (месяц зачатия - 2.)', '42 (месяц зачатия - 4.)', '42 (месяц зачатия - 6.)', '42 (месяц зачатия - 8.)', 	'42 (месяц зачатия - 9.)', '42 (месяц зачатия - 11.)', '43 (месяц зачатия - 1.)', '43 (месяц зачатия - 3.)', '43 (месяц зачатия - 5.)', '43 (месяц зачатия - 7.)', '43 (месяц зачатия - 9.)', '43 (месяц зачатия - 10.)', 	'43 (месяц зачатия - 11.)', '43 (месяц зачатия - 12.)', '44 (месяц зачатия - 1.)', '44 (месяц зачатия - 2.)', '44 (месяц зачатия - 4.)', '44 (месяц зачатия - 5.)', '44 (месяц зачатия - 6.)', '44 (месяц зачатия - 8.)', '44 (месяц зачатия - 10.)', '45 (месяц зачатия - 2.)', '45 (месяц зачатия - 3.)', '45 (месяц зачатия - 7.)', '45 (месяц зачатия - 9.)', '45 (месяц зачатия - 11.)', '45 (месяц зачатия - 12.)']
i14 = ['18 (месяц зачатия - 1.)', '18 (месяц зачатия - 3.)',  '19 (месяц зачатия - 2.)', '19 (месяц зачатия - 4.)', '19 (месяц зачатия - 11.)', '19 (месяц зачатия - 12.)', '20 (месяц зачатия - 1.)', '20 (месяц зачатия - 3.)', '20 (месяц зачатия - 9.)',  '21 (месяц зачатия - 2.)', '21 (месяц зачатия - 3.)', '21 (месяц зачатия - 4.)', '21 (месяц зачатия - 5.)', '21 (месяц зачатия - 6.)', '21 (месяц зачатия - 7.)', '21 (месяц зачатия - 8.)', '21 (месяц зачатия - 9.)', '21 (месяц зачатия - 10.)', '21 (месяц зачатия - 11.)', '21 (месяц зачатия - 12.)', '22 (месяц зачатия - 1.)', '22 (месяц зачатия - 4.)', '22 (месяц зачатия - 6.)', '22 (месяц зачатия - 7.)', '22 (месяц зачатия - 9.)', '22 (месяц зачатия - 10.)', '22 (месяц зачатия - 11.)', '22 (месяц зачатия - 12.)',  '23 (месяц зачатия - 3.)', '23 (месяц зачатия - 6.)', '23 (месяц зачатия - 8.)', '23 (месяц зачатия - 12.)',  '24 (месяц зачатия - 2.)', '24 (месяц зачатия - 5.)', '24 (месяц зачатия - 8.)', '24 (месяц зачатия - 9.)', '24 (месяц зачатия - 10.)', '24 (месяц зачатия - 11.)', '24 (месяц зачатия - 12.)', '25 (месяц зачатия - 1.)', '25 (месяц зачатия - 4.)', '25 (месяц зачатия - 5.)', '25 (месяц зачатия - 7.)', '25 (месяц зачатия - 8.)', '26 (месяц зачатия - 2.)', '26 (месяц зачатия - 4.)', '26 (месяц зачатия - 5.)', '26 (месяц зачатия - 7.)', '26 (месяц зачатия - 9.)', '26 (месяц зачатия - 10.)', '26 (месяц зачатия - 11.)', '26 (месяц зачатия - 12.)', '27 (месяц зачатия - 1.)', '27 (месяц зачатия - 3.)', '27 (месяц зачатия - 4.)', '27 (месяц зачатия - 5.)', '27 (месяц зачатия - 6.)', '27 (месяц зачатия - 11.)',  '28 (месяц зачатия - 2.)', '28 (месяц зачатия - 4.)', '28 (месяц зачатия - 5.)', '28 (месяц зачатия - 6.)', '28 (месяц зачатия - 11.)', '28 (месяц зачатия - 12.)', '29 (месяц зачатия - 1.)', '29 (месяц зачатия - 3.)', '29 (месяц зачатия - 4.)', '29 (месяц зачатия - 7.)', '29 (месяц зачатия - 10.)', '29 (месяц зачатия - 11.)', '29 (месяц зачатия - 12.)',  '30 (месяц зачатия - 2.)', '30 (месяц зачатия - 3.)', '30 (месяц зачатия - 4.)', '30 (месяц зачатия - 5.)', '30 (месяц зачатия - 6.)', '30 (месяц зачатия - 7.)', '30 (месяц зачатия - 8.)', '30 (месяц зачатия - 9.)', '30 (месяц зачатия - 10.)',  '31 (месяц зачатия - 2.)', '31 (месяц зачатия - 4.)', '31 (месяц зачатия - 5.)', '31 (месяц зачатия - 6.)', '31 (месяц зачатия - 7.)', '31 (месяц зачатия - 8.)', '31 (месяц зачатия - 9.)', '31 (месяц зачатия - 10.)', '31 (месяц зачатия - 11.)',  '32 (месяц зачатия - 2.)', '32 (месяц зачатия - 4.)', '32 (месяц зачатия - 5.)', '32 (месяц зачатия - 6.)', '32 (месяц зачатия - 7.)', '32 (месяц зачатия - 8.)', '32 (месяц зачатия - 9.)', '32 (месяц зачатия - 10.)', '32 (месяц зачатия - 11.)', '33 (месяц зачатия - 1.)', '33 (месяц зачатия - 3.)', '33 (месяц зачатия - 5.)', '33 (месяц зачатия - 6.)', '33 (месяц зачатия - 7.)', '33 (месяц зачатия - 9.)', '33 (месяц зачатия - 10.)', '33 (месяц зачатия - 11.)', '34 (месяц зачатия - 1.)', '34 (месяц зачатия - 2.)', '34 (месяц зачатия - 4.)', '34 (месяц зачатия - 5.)', '34 (месяц зачатия - 6.)', '34 (месяц зачатия - 7.)', '34 (месяц зачатия - 8.)', '34 (месяц зачатия - 9.)', '34 (месяц зачатия - 10.)',  '35 (месяц зачатия - 3.)', '35 (месяц зачатия - 5.)', '35 (месяц зачатия - 6.)', '35 (месяц зачатия - 7.)', '35 (месяц зачатия - 9.)', '35 (месяц зачатия - 10.)', '36 (месяц зачатия - 1.)', '36 (месяц зачатия - 4.)', '36 (месяц зачатия - 6.)', '36 (месяц зачатия - 7.)', '36 (месяц зачатия - 8.)',  '37 (месяц зачатия - 2.)', '37 (месяц зачатия - 5.)', '37 (месяц зачатия - 7.)', '37 (месяц зачатия - 9.)', '37 (месяц зачатия - 11.)', '38 (месяц зачатия - 1.)', '38 (месяц зачатия - 3.)', '38 (месяц зачатия - 6.)', '38 (месяц зачатия - 8.)', '38 (месяц зачатия - 10.)', '38 (месяц зачатия - 12.)',  '39 (месяц зачатия - 2.)', '39 (месяц зачатия - 6.)', '39 (месяц зачатия - 7.)', '39 (месяц зачатия - 9.)', '39 (месяц зачатия - 11.)', '39 (месяц зачатия - 12.)', '40 (месяц зачатия - 1.)', '40 (месяц зачатия - 3.)', '40 (месяц зачатия - 5.)', '40 (месяц зачатия - 8.)', '40 (месяц зачатия - 10.)', '40 (месяц зачатия - 12.)',  '41 (месяц зачатия - 2.)', '41 (месяц зачатия - 4.)', '41 (месяц зачатия - 6.)', '41 (месяц зачатия - 9.)', '41 (месяц зачатия - 11.)', '42 (месяц зачатия - 1.)', '42 (месяц зачатия - 3.)', '42 (месяц зачатия - 5.)', '42 (месяц зачатия - 7.)', '42 (месяц зачатия - 10.)', '42 (месяц зачатия - 12.)',  '43 (месяц зачатия - 2.)', '43 (месяц зачатия - 4.)', '43 (месяц зачатия - 6.)', '43 (месяц зачатия - 8.)',  '44 (месяц зачатия - 3.)', '44 (месяц зачатия - 7.)', '44 (месяц зачатия - 9.)', '44 (месяц зачатия - 11.)', '44 (месяц зачатия - 12.)', '45 (месяц зачатия - 1.)', '45 (месяц зачатия - 4.)', '45 (месяц зачатия - 5.)', '45 (месяц зачатия - 6.)', '45 (месяц зачатия - 8.)', '45 (месяц зачатия - 10.)']
lk = 'В следующем таблице в столбце ГОД выберите ваш год рождения. Если вы родились раньше указанной даты прибавьте 2 к вашему возрасту, в противном случае прибавьте 1.\nПример: Вы родились 05.01.2000 году.\nВ таблице напротив 2000 года показана дата 05.02.2000.\nВам сейчас 20 лет. Так как 05.01.2000 раньше 05.02.2000, к 20 прибавим 2, в итоге ваш лунный возраст 22 года.\n    \nГод  	          Число \n               китайского \n               Нового года\n2020	  -   25.01.2020\n2019	  -   05.02.2019\n2018	  -   16.02.2018\n2017	  -   28.01.2017\n2016	  -   08.02.2016\n2015	  -   18.02.2015\n2014	  -   31.01.2014\n2013	  -   10.02.2013\n2012	  -   23.01.2012\n2011	  -   03.02.2011\n2010	  -   14.02.2010\n2009	  -   26.01.2009\n2008	  -   07.02.2008\n2007	  -   18.02.2007\n2006	  -   29.01.2006\n2005	  -   09.02.2005\n2004	  -   22.01.2004\n2003	  -   01.02.2003\n2002	  -   12.02.2002\n2001	  -   24.01.2001\n2000	  -   05.02.2000\n1999	  -   16.02.1999\n1998	  -   28.01.1998\n1997	  -   07.02.1997\n1996	  -   19.02.1996\n1995	  -   31.01.1995\n1994	  -   10.02.1994\n1993	  -   23.01.1993\n1992	  -   04.02.1992\n1991	  -   15.02.1991\n1990	  -   27.01.1990\n1989	  -   06.02.1989\n1988	  -   17.02.1988\n1987	  -   29.01.1987\n1986	  -   09.02.1986\n1985	  -   20.02.1985\n1984	  -   02.02.1984\n1983	  -   13.02.1983\n1982	  -   25.01.1982\n1981	  -   05.02.1981\n1980	  -   16.02.1980\n1979	  -   28.01.1979\n1978	  -   07.02.1978\n1977	  -   18.02.1977\n1976	  -   31.01.1976'
 

bot.polling(none_stop=True)
